jowdow/Mastering-Microcontroller-and-Embedded-Driver-Development-STM32F302R8T6/stm32f302xx.h
/*
 * stm32f302xx.h
 *
 *  Created on: Jun 14, 2022
 *      Author: josep
 */



/*	READ THE BLOCK DIAGRAM AS IT WILL GIVE THE CORRECT BUS FOR MOST THINGS
 *
 *
 * The block diagram is mostly correct
 *
 *
 *
 * */
#ifndef INC_STM32F302XX_H_
#define INC_STM32F302XX_H_

#include <stdint.h>
#include<stddef.h>


#define __vo volatile
#define __weak __attribute__((weak))


/**********************************START:Processor Specific Details **********************************/
/*
 * ARM Cortex Mx Processor NVIC ISERx register Addresses
 */

#define NVIC_ISER0          ( (__vo uint32_t*)0xE000E100 )
#define NVIC_ISER1          ( (__vo uint32_t*)0xE000E104 )
#define NVIC_ISER2          ( (__vo uint32_t*)0xE000E108 )
#define NVIC_ISER3          ( (__vo uint32_t*)0xE000E10c )


/*
 * ARM Cortex Mx Processor NVIC ICERx register Addresses
 */
#define NVIC_ICER0 			((__vo uint32_t*)0XE000E180)
#define NVIC_ICER1			((__vo uint32_t*)0XE000E184)
#define NVIC_ICER2  		((__vo uint32_t*)0XE000E188)
#define NVIC_ICER3			((__vo uint32_t*)0XE000E18C)


/*
 * ARM Cortex Mx Processor Priority Register Address Calculation
 */
#define NVIC_PR_BASE_ADDR 	((__vo uint32_t*)0xE000E400)

/*
 * ARM Cortex Mx Processor number of priority bits implemented in Priority Register
 */
#define NO_PR_BITS_IMPLEMENTED  4

/*
 * base addresses of Flash and SRAM memories
 */

#define FLASH_BASEADDR			0x08000000U // 64KB
#define SRAM1_BASEADDR			0x20000000U //16KB

#define ROM						0x1FFFD800U // 8KB
#define SRAM					SRAM1_BASEADDR



/*
 * AHBx and APBx Bus Peripheral base addresses
 * */
#define PERIPH_BASE				0x40000000U

#define APB1PERIPH_BASE			PERIPH_BASE
#define APB2PERIPH_BASE			0x40010000U
#define AHB1PERIPH_BASE			0x40020000U
#define AHB2PERIPH_BASE			0x48000000U
#define AHB3PERIPH_BASE			0x50000000U



/*
 * Base Addresses of peripherals on the APB1 bus
 * */
#define TIM2_BASEADDR			( APB1PERIPH_BASE )
#define TIM3_BASEADDR			( APB1PERIPH_BASE + 0x400 )
#define TIM4_BASEADDR			( APB1PERIPH_BASE + 0x800 )
#define TIM6_BASEADDR			( APB1PERIPH_BASE + 0x1000 )
#define TIM7_BASEADDR			( APB1PERIPH_BASE + 0x1400 )
#define WWDG_BASEADDR			( APB1PERIPH_BASE + 0x2C00)

#define RTC_BASEADDR			( APB1PERIPH_BASE + 0x2800 )

#define IWDG_BASEADDR			( APB1PERIPH_BASE + 0x3000 )

#define I2S2EXT_BASEADDR			( APB1PERIPH_BASE + 0x3400 )
#define I2S3EXT_BASEADDR			( APB1PERIPH_BASE + 0x4000 )

#define SPI2_BASEADDR			( APB1PERIPH_BASE + 0x3800 )
#define SPI3_BASEADDR			( APB1PERIPH_BASE + 0x3C00 )

#define USART2_BASEADDR			( APB1PERIPH_BASE + 0x4400 )
#define USART3_BASEADDR			( APB1PERIPH_BASE + 0x4800 )
#define USART4_BASEADDR			( APB1PERIPH_BASE + 0x4C00 )
#define USART5_BASEADDR			( APB1PERIPH_BASE + 0x5000 )

#define I2C1_BASEADDR			( APB1PERIPH_BASE + 0x5400 )
#define I2C2_BASEADDR			( APB1PERIPH_BASE + 0x5800 )
#define I2C3_BASEADDR			( APB1PERIPH_BASE + 0x7800 )

#define USB_FS_BASEADDR			( APB1PERIPH_BASE + 0x5C00 )

#define CAN_BASEADDR			( APB1PERIPH_BASE + 0x6400 )

#define PWR_BASEADDR			( APB1PERIPH_BASE + 0x7000 )

#define DAC_BASEADDR			( APB1PERIPH_BASE + 0x7400 )

/*
 * Base Addresses of peripherals on the APB2 bus
 * */
#define SYSCFG_BASEADDR			( APB2PERIPH_BASE )

#define EXTI_BASEADDR			( APB2PERIPH_BASE + 0X0400)

#define TIM1_BASEADDR			( APB2PERIPH_BASE + 0X2C00)
#define TIM8_BASEADDR			( APB2PERIPH_BASE + 0X3400)
#define TIM20_BASEADDR			( APB2PERIPH_BASE + 0X5000)

#define SPI1_BASEADDR			( APB2PERIPH_BASE + 0x3000 )
#define SPI4_BASEADDR			( APB2PERIPH_BASE + 0x3C00 )

#define USART1_BASEADDR			( APB2PERIPH_BASE + 0X3800)

#define TIM15_BASEADDR			( APB2PERIPH_BASE + 0x4000 )
#define TIM16_BASEADDR			( APB2PERIPH_BASE + 0x4400 )
#define TIM17_BASEADDR			( APB2PERIPH_BASE + 0x4800 )

/*
 * Base Addresses of peripherals on the AHB1 bus
 * */

#define DMA1_BASEADDR			( AHB1PERIPH_BASE)

#define RCC_BASEADDR			( AHB1PERIPH_BASE + 0x1000 )

#define CRC_BASEADDR			( AHB1PERIPH_BASE + 0x3000 )

#define TSC_BASEADDR			( AHB1PERIPH_BASE + 0x4000 )

/*
 * Base Addresses of peripherals on the AHB2 bus
 * */

#define GPIOA_BASEADDR			( AHB2PERIPH_BASE + 0x0000 )
#define GPIOB_BASEADDR			( AHB2PERIPH_BASE + 0x0400 )
#define GPIOC_BASEADDR			( AHB2PERIPH_BASE + 0x0800 )
#define GPIOD_BASEADDR			( AHB2PERIPH_BASE + 0x0C00 )
#define GPIOF_BASEADDR			( AHB2PERIPH_BASE + 0x1400 )

/*
 * Base Addresses of peripherals on the AHB3 bus
 * */

#define ADC1_BASEADDR			( AHB3PERIPH_BASE )
#define ADC2_BASEADDR			( AHB3PERIPH_BASE + 0x100 )
#define ADC1_2_BASEADDR			( AHB3PERIPH_BASE + 0x300 )
#define ADC3_BASEADDR			( AHB3PERIPH_BASE + 0x400 )
#define ADC4_BASEADDR			( AHB3PERIPH_BASE + 0x500 )
#define ADC3_4_BASEADDR			( AHB3PERIPH_BASE + 0x700 )


/**********************************peripheral register definition structures **********************************/

/*
 * Note : Registers of a peripheral are specific to MCU
 * e.g : Number of Registers of SPI peripheral of STM32F4x family of MCUs may be different(more or less)
 * Compared to number of registers of SPI peripheral of STM32Lx or STM32F0x family of MCUs
 * Please check your Device RM
 */
typedef struct{
	volatile uint32_t MODER;			// Offset: 0x00
	volatile uint32_t OTYPER;			// Offset: 0x04
	volatile uint32_t OSPEEDR;			// Offset: 0x08
	volatile uint32_t PUPDR;			// Offset: 0x0C
	volatile uint32_t IDR;				// Offset: 0x10
	volatile uint32_t ODR;				// Offset: 0x14
	volatile uint32_t BSRP;				// Offset: 0x18
	volatile uint32_t LCKR;				// Offset: 0x1C
	volatile uint32_t AFR[2];			// Offset: 0x20 - 0x24  [0] Low  [1] High
} GPIO_RegDef_t;


/*
 * peripheral register definition structure for RCC
 */
typedef struct{
	volatile uint32_t CR;				// Offset: 0x00
	volatile uint32_t CFGR;				// Offset: 0x04
	volatile uint32_t CIR;				// Offset: 0x08
	volatile uint32_t APB2RSTR;			// Offset: 0x0C
	volatile uint32_t APB1RSTR;			// Offset: 0x10
	volatile uint32_t AHBENR;			// Offset: 0x14
	volatile uint32_t APB2ENR;			// Offset: 0x18
	volatile uint32_t APB1ENR;			// Offset: 0x1C
	volatile uint32_t BDCR;				// Offset: 0x20
	volatile uint32_t CSR;				// Offset: 0x24
	volatile uint32_t AHBRSTR;			// Offset: 0x28
	volatile uint32_t CFGR2;			// Offset: 0x2C
	volatile uint32_t CFGR3;			// Offset: 0x30

} RCC_RegDef_t;


/*
 * peripheral register definition structure for EXTI
 */
typedef struct
{
	__vo uint32_t IMR;    /*!< Give a short description,          	  	    Address offset: 0x00 */
	__vo uint32_t EMR;    /*!< TODO,                						Address offset: 0x04 */
	__vo uint32_t RTSR;   /*!< TODO,  									     Address offset: 0x08 */
	__vo uint32_t FTSR;   /*!< TODO, 										Address offset: 0x0C */
	__vo uint32_t SWIER;  /*!< TODO,  									   Address offset: 0x10 */
	__vo uint32_t PR;     /*!< TODO,                   					   Address offset: 0x14 */

}EXTI_RegDef_t;

/*
 * peripheral register definition structure for SPI
 */
typedef struct
{
	__vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x00 */
	__vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x04 */
	__vo uint32_t SR;         /*!< TODO,     										Address offset: 0x08 */
	__vo uint32_t DR;         /*!< TODO,     										Address offset: 0x0C */
	__vo uint32_t CRCPR;      /*!< TODO,     										Address offset: 0x10 */
	__vo uint32_t RXCRCR;     /*!< TODO,     										Address offset: 0x14 */
	__vo uint32_t TXCRCR;     /*!< TODO,     										Address offset: 0x18 */
	__vo uint32_t I2SCFGR;    /*!< TODO,     										Address offset: 0x1C */
	__vo uint32_t I2SPR;      /*!< TODO,     										Address offset: 0x20 */
} SPI_RegDef_t;

/*
 * peripheral register definition structure for SYSCFG
 */
typedef struct
{
	__vo uint32_t MEMRMP;       /*!< Give a short description,                    Address offset: 0x00      */
	__vo uint32_t PMC;          /*!< TODO,     									  Address offset: 0x04      */
	__vo uint32_t EXTICR[4];    /*!< TODO , 									  Address offset: 0x08-0x14 */
	uint32_t      RESERVED1[2];  /*!< TODO          							  Reserved, 0x18-0x1C    	*/
	__vo uint32_t CMPCR;        /*!< TODO         								  Address offset: 0x20      */
	uint32_t      RESERVED2[2];  /*!<                                             Reserved, 0x24-0x28 	    */
	__vo uint32_t CFGR;         /*!< TODO                                         Address offset: 0x2C   	*/
} SYSCFG_RegDef_t;

/*
 * peripheral register definition structure for I2C
 */
typedef struct
{
  __vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x00 */
  __vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x04 */
  __vo uint32_t OAR1;       /*!< TODO,     										Address offset: 0x08 */
  __vo uint32_t OAR2;       /*!< TODO,     										Address offset: 0x0C */
  __vo uint32_t DR;         /*!< TODO,     										Address offset: 0x10 */
  __vo uint32_t SR1;        /*!< TODO,     										Address offset: 0x14 */
  __vo uint32_t SR2;        /*!< TODO,     										Address offset: 0x18 */
  __vo uint32_t CCR;        /*!< TODO,     										Address offset: 0x1C */
  __vo uint32_t TRISE;      /*!< TODO,     										Address offset: 0x20 */
  __vo uint32_t FLTR;       /*!< TODO,     										Address offset: 0x24 */
}I2C_RegDef_t;

/*
 * peripheral register definition structure for USART
 */
typedef struct
{
	__vo uint32_t SR;         /*!< TODO,     										Address offset: 0x00 */
	__vo uint32_t DR;         /*!< TODO,     										Address offset: 0x04 */
	__vo uint32_t BRR;        /*!< TODO,     										Address offset: 0x08 */
	__vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x0C */
	__vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x10 */
	__vo uint32_t CR3;        /*!< TODO,     										Address offset: 0x14 */
	__vo uint32_t GTPR;       /*!< TODO,     										Address offset: 0x18 */
} USART_RegDef_t;




/*
 * peripheral definitions ( Peripheral base addresses typecasted to xxx_RegDef_t)
 */

#define GPIOA					( ( GPIO_RegDef_t* ) GPIOA_BASEADDR )
#define GPIOB					( ( GPIO_RegDef_t* ) GPIOB_BASEADDR )
#define GPIOC					( ( GPIO_RegDef_t* ) GPIOC_BASEADDR )
#define GPIOD					( ( GPIO_RegDef_t* ) GPIOD_BASEADDR )
#define GPIOF					( ( GPIO_RegDef_t* ) GPIOF_BASEADDR )

#define RCC						( ( RCC_RegDef_t* ) RCC_BASEADDR )
#define EXTI					((EXTI_RegDef_t*)EXTI_BASEADDR)
#define SYSCFG					((SYSCFG_RegDef_t*)SYSCFG_BASEADDR)

#define SPI1  					((SPI_RegDef_t*)SPI1_BASEADDR)
#define SPI2  					((SPI_RegDef_t*)SPI2_BASEADDR)
#define SPI3  					((SPI_RegDef_t*)SPI3_BASEADDR)

#define I2C1  					((I2C_RegDef_t*)I2C1_BASEADDR)
#define I2C2  					((I2C_RegDef_t*)I2C2_BASEADDR)


#define USART1  				((USART_RegDef_t*)USART1_BASEADDR)
#define USART2  				((USART_RegDef_t*)USART2_BASEADDR)
#define USART3  				((USART_RegDef_t*)USART3_BASEADDR)


/*
 * Clock Enable Macros for GPIOx Peripherals
 * */
#define GPIOA_PCLK_EN()			( RCC->AHBENR |= ( 1 << 17 ) )
#define GPIOB_PCLK_EN()			( RCC->AHBENR |= ( 1 << 18 ) )
#define GPIOC_PCLK_EN()			( RCC->AHBENR |= ( 1 << 19 ) )
#define GPIOD_PCLK_EN()			( RCC->AHBENR |= ( 1 << 20 ) )
#define GPIOF_PCLK_EN()			( RCC->AHBENR |= ( 1 << 22 ) )

/*
 * Clock Enable Macros for I2Cx Peripherals
 * */

#define I2C1_PCLK_EN()			( RCC->APB1ENR |= ( 1 << 21 ) )
#define I2C2_PCLK_EN()			( RCC->APB1ENR |= ( 1 << 22 ) )
// #define I2C3_PCLK_EN()		( RCC->APB1ENR |= ( 1 <<  ) )  // For some reason when i debug the board it says it has I2C3 so idk

/*
 * Clock Enable Macros for SPIx Peripherals
 * */

#define SPI1_PCLK_EN()			( RCC->APB2ENR |= ( 1 << 12 ) )
#define SPI2_PCLK_EN()			( RCC->APB1ENR |= ( 1 << 14 ) )
#define SPI3_PCLK_EN()			( RCC->APB1ENR |= ( 1 << 15 ) )
// #define SPI4_PCLK_EN()			( RCC->APB2ENR |= ( 1 << 15 ) ) // For some reason when i debug the board it says it has SPI3 so idk

/*
 * Clock Enable Macros for USARTx Peripherals
 * */

#define USART1_PCLK_EN()		( RCC->APB2ENR |= ( 1 << 14 ) )
#define USART2_PCLK_EN()		( RCC->APB1ENR |= ( 1 << 17 ) )
#define USART3_PCLK_EN()		( RCC->APB1ENR |= ( 1 << 18 ) )
//#define USART4_PCLK_EN()		( RCC->APB1ENR |= ( 1 << 12 ) )
//#define USART5_PCLK_EN()		( RCC->APB1ENR |= ( 1 << 12 ) )

/*
 * Clock Enable Macros for SYSCRGx Peripherals
 * */

#define SYSCFG_PCLK_EN()		( RCC->APB2ENR |= ( 1 << 0 ) )



/*
 * Clock Disable Macros for GPIOx Peripherals
 * */
#define GPIOA_PCLK_DI()			( RCC->AHBENR &= ~( 1 << 17 ) )
#define GPIOB_PCLK_DI()			( RCC->AHBENR &= ~( 1 << 18 ) )
#define GPIOC_PCLK_DI()			( RCC->AHBENR &= ~( 1 << 19 ) )
#define GPIOD_PCLK_DI()			( RCC->AHBENR &= ~( 1 << 20 ) )
#define GPIOF_PCLK_DI()			( RCC->AHBENR &= ~( 1 << 22 ) )

/*
 * Clock Disable Macros for I2Cx Peripherals
 * */

#define I2C1_PCLK_DI()			( RCC->APB1ENR &= ~( 1 << 21 ) )
#define I2C2_PCLK_DI()			( RCC->APB1ENR &= ~( 1 << 22 ) )
// #define I2C3_PCLK_DI()		( RCC->APB1ENR &= ~( 1 <<  ) )  // For some reason when i debug the board it says it has I2C3 so idk

/*
 * Clock Disable Macros for SPIx Peripherals
 * */

#define SPI1_PCLK_DI()			( RCC->APB2ENR &= ~( 1 << 12 ) )
#define SPI2_PCLK_DI()			( RCC->APB1ENR &= ~( 1 << 14 ) )
#define SPI3_PCLK_DI()			( RCC->APB1ENR &= ~( 1 << 15 ) )
// #define SPI4_PCLK_DI()			( RCC->APB2ENR &= ~( 1 << 15 ) ) // For some reason when i debug the board it says it has SPI3 so idk

/*
 * Clock Disable Macros for USARTx Peripherals
 * */

#define USART1_PCLK_DI()		( RCC->APB2ENR &= ~( 1 << 14 ) )
#define USART2_PCLK_DI()		( RCC->APB1ENR &= ~( 1 << 17 ) )
#define USART3_PCLK_DI()		( RCC->APB1ENR &= ~( 1 << 18 ) )
//#define USART4_PCLK_DI()		( RCC->APB1ENR &= ~( 1 << 12 ) )
//#define USART5_PCLK_DI()		( RCC->APB1ENR &= ~( 1 << 12 ) )

/*
 * Clock Disable Macros for SYSCRGx Peripherals
 * */

#define SYSCFG_PCLK_DI()		( RCC->APB2ENR &= ~( 1 << 0 ) )


/*
 *  Macros to reset GPIOx peripherals
 */
#define GPIOA_REG_RESET()               do{ (RCC->AHBRSTR |= (1 << 17)); (RCC->AHBRSTR &= ~(1 << 17)); }while(0)
#define GPIOB_REG_RESET()               do{ (RCC->AHBRSTR |= (1 << 18)); (RCC->AHBRSTR &= ~(1 << 18)); }while(0)
#define GPIOC_REG_RESET()               do{ (RCC->AHBRSTR |= (1 << 19)); (RCC->AHBRSTR &= ~(1 << 19)); }while(0)
#define GPIOD_REG_RESET()               do{ (RCC->AHBRSTR |= (1 << 20)); (RCC->AHBRSTR &= ~(1 << 20)); }while(0)
#define GPIOF_REG_RESET()               do{ (RCC->AHBRSTR |= (1 << 22)); (RCC->AHBRSTR &= ~(1 << 22)); }while(0)


/*
 *  returns port code for given GPIOx base address
 */
/*
 * This macro returns a code( between 0 to 7) for a given GPIO base address(x)
 */
#define GPIO_BASEADDR_TO_CODE(x)      ( (x == GPIOA)?0:\
										(x == GPIOB)?1:\
										(x == GPIOC)?2:\
										(x == GPIOD)?3:\
										(x == GPIOF)?5:0)


/*
 * IRQ(Interrupt Request) Numbers of STM32F302x MCU
 * NOTE: update these macros with valid values according to your MCU
 * TODO: You may complete this list for other peripherals
 */

#define IRQ_NO_EXTI0 		6
#define IRQ_NO_EXTI1 		7
#define IRQ_NO_EXTI2 		8
#define IRQ_NO_EXTI3 		9
#define IRQ_NO_EXTI4 		10
#define IRQ_NO_EXTI9_5 		23
#define IRQ_NO_EXTI15_10 	40
#define IRQ_NO_SPI1			35
#define IRQ_NO_SPI2         36
#define IRQ_NO_SPI3         51
#define IRQ_NO_SPI4
#define IRQ_NO_I2C1_EV     31
#define IRQ_NO_I2C1_ER     32
#define IRQ_NO_USART1	    37
#define IRQ_NO_USART2	    38
#define IRQ_NO_USART3	    39
#define IRQ_NO_UART4	    52
#define IRQ_NO_UART5	    53
#define IRQ_NO_USART6	    71


//some generic macros

#define ENABLE 				1
#define DISABLE 			0
#define SET 				ENABLE
#define RESET 				DISABLE
#define GPIO_PIN_SET        SET
#define GPIO_PIN_RESET      RESET
#define FLAG_RESET         RESET
#define FLAG_SET 			SET


/******************************************************************************************
 *Bit position definitions of SPI peripheral
 ******************************************************************************************/
/*
 * Bit position definitions SPI_CR1
 */
#define SPI_CR1_CPHA     				 0
#define SPI_CR1_CPOL      				 1
#define SPI_CR1_MSTR     				 2
#define SPI_CR1_BR   					 3
#define SPI_CR1_SPE     				 6
#define SPI_CR1_LSBFIRST   			 	 7
#define SPI_CR1_SSI     				 8
#define SPI_CR1_SSM      				 9
#define SPI_CR1_RXONLY      		 	10
#define SPI_CR1_DFF     			 	11
#define SPI_CR1_CRCNEXT   			 	12
#define SPI_CR1_CRCEN   			 	13
#define SPI_CR1_BIDIOE     			 	14
#define SPI_CR1_BIDIMODE      			15

/*
 * Bit position definitions SPI_CR2
 */
#define SPI_CR2_RXDMAEN		 			0
#define SPI_CR2_TXDMAEN				 	1
#define SPI_CR2_SSOE				 	2
#define SPI_CR2_FRF						4
#define SPI_CR2_ERRIE					5
#define SPI_CR2_RXNEIE				 	6
#define SPI_CR2_TXEIE					7


/*
 * Bit position definitions SPI_SR
 */
#define SPI_SR_RXNE						0
#define SPI_SR_TXE				 		1
#define SPI_SR_CHSIDE				 	2
#define SPI_SR_UDR					 	3
#define SPI_SR_CRCERR				 	4
#define SPI_SR_MODF					 	5
#define SPI_SR_OVR					 	6
#define SPI_SR_BSY					 	7
#define SPI_SR_FRE					 	8

/******************************************************************************************
 *Bit position definitions of I2C peripheral
 ******************************************************************************************/
/*
 * Bit position definitions I2C_CR1
 */
#define I2C_CR1_PE						0
#define I2C_CR1_NOSTRETCH  				7
#define I2C_CR1_START 					8
#define I2C_CR1_STOP  				 	9
#define I2C_CR1_ACK 				 	10
#define I2C_CR1_SWRST  				 	15

/*
 * Bit position definitions I2C_CR2
 */
#define I2C_CR2_FREQ				 	0
#define I2C_CR2_ITERREN				 	8
#define I2C_CR2_ITEVTEN				 	9
#define I2C_CR2_ITBUFEN 			    10

/*
 * Bit position definitions I2C_OAR1
 */
#define I2C_OAR1_ADD0    				 0
#define I2C_OAR1_ADD71 				 	 1
#define I2C_OAR1_ADD98  			 	 8
#define I2C_OAR1_ADDMODE   			 	15

/*
 * Bit position definitions I2C_SR1
 */

#define I2C_SR1_SB 					 	0
#define I2C_SR1_ADDR 				 	1
#define I2C_SR1_BTF 					2
#define I2C_SR1_ADD10 					3
#define I2C_SR1_STOPF 					4
#define I2C_SR1_RXNE 					6
#define I2C_SR1_TXE 					7
#define I2C_SR1_BERR 					8
#define I2C_SR1_ARLO 					9
#define I2C_SR1_AF 					 	10
#define I2C_SR1_OVR 					11
#define I2C_SR1_TIMEOUT 				14

/*
 * Bit position definitions I2C_SR2
 */
#define I2C_SR2_MSL						0
#define I2C_SR2_BUSY 					1
#define I2C_SR2_TRA 					2
#define I2C_SR2_GENCALL 				4
#define I2C_SR2_DUALF 					7

/*
 * Bit position definitions I2C_CCR
 */
#define I2C_CCR_CCR 					 0
#define I2C_CCR_DUTY 					14
#define I2C_CCR_FS  				 	15

/******************************************************************************************
 *Bit position definitions of USART peripheral
 ******************************************************************************************/

/*
 * Bit position definitions USART_CR1
 */
#define USART_CR1_SBK					0
#define USART_CR1_RWU 					1
#define USART_CR1_RE  					2
#define USART_CR1_TE 					3
#define USART_CR1_IDLEIE 				4
#define USART_CR1_RXNEIE  				5
#define USART_CR1_TCIE					6
#define USART_CR1_TXEIE					7
#define USART_CR1_PEIE 					8
#define USART_CR1_PS 					9
#define USART_CR1_PCE 					10
#define USART_CR1_WAKE  				11
#define USART_CR1_M 					12
#define USART_CR1_UE 					13
#define USART_CR1_OVER8  				15



/*
 * Bit position definitions USART_CR2
 */
#define USART_CR2_ADD   				0
#define USART_CR2_LBDL   				5
#define USART_CR2_LBDIE  				6
#define USART_CR2_LBCL   				8
#define USART_CR2_CPHA   				9
#define USART_CR2_CPOL   				10
#define USART_CR2_STOP   				12
#define USART_CR2_LINEN   				14


/*
 * Bit position definitions USART_CR3
 */
#define USART_CR3_EIE   				0
#define USART_CR3_IREN   				1
#define USART_CR3_IRLP  				2
#define USART_CR3_HDSEL   				3
#define USART_CR3_NACK   				4
#define USART_CR3_SCEN   				5
#define USART_CR3_DMAR  				6
#define USART_CR3_DMAT   				7
#define USART_CR3_RTSE   				8
#define USART_CR3_CTSE   				9
#define USART_CR3_CTSIE   				10
#define USART_CR3_ONEBIT   				11

/*
 * Bit position definitions USART_SR
 */

#define USART_SR_PE        				0
#define USART_SR_FE        				1
#define USART_SR_NE        				2
#define USART_SR_ORE       				3
#define USART_SR_IDLE       			4
#define USART_SR_RXNE        			5
#define USART_SR_TC        				6
#define USART_SR_TXE        			7
#define USART_SR_LBD        			8
#define USART_SR_CTS        			9


#include "stm32f302xx_gpio_driver.h"

#endif /* INC_STM32F302XX_H_ */
